package HomeWork1;

public class Task2 {

    public static void main(String[] args) {
        // 5 + 2 / 8
        System.out.println(5 + 2 / 8);
        // Если не приводить к double, то будет ответ 5 (сначала 2 / 8 = 0, затем 5 + 0 = 5).

        // (5 + 2) / 8
        System.out.println((5 + 2) / 8);
        // Если не приводить к double, то будет ответ 0 (сначала 5 + 2 = 7, затем 7 / 8 = 0).

        // (5 + 2++) / 8
        int a = 2;
        System.out.println((5 + a++) / 8);
        // Ответ 0 (cначала 5 + 2 = 7, затем a = 2 + 1 = 3, затем 7 / 8 = 0).

        // (5 + 2++) / --8
        a = 2;
        int b = 8;
        System.out.println((5 + a++) / --b);
        // Ответ 1 (cначала 5 + 2 = 7, затем a = 2 + 1 = 3, затем b = 8 - 1 = 7,
        // затем 7 / 7 = 1).

        // (5 * 2 >> 2++) / --8
        a = 2;
        b = 8;
        System.out.println((5 * 2 >> a++) / --b);
        // Ответ 0 (cначала 5 * 2 = 10, затем 10 >> 2 = 2, затем a = 2 + 1 = 3,
        // затем b = 8 - 1 = 7, затем 2 / 7 = 0).

        // (5 + 7 > 20 ? 68 : 22 * 2 >> 2++) / --8
        a = 2;
        b = 8;
        System.out.println((5 + 7 > 20 ? 68 : 22 * 2 >> a++) / --b);
        // Ответ 1 (cначала 5 + 7 = 12, 12 < 20, значит вычисляем 22 * 2 = 44 и 44 >> 2 = 11,
        // затем a = 2 + 1 = 3, затем b = 8 - 1 = 7, затем 11 / 7 = 1).

        // (5 + 7 > 20 ? 68 >= 68 : 22 * 2 >> 2++) / --8
        a = 2;
        b = 8;
        // System.out.println((5 + 7 > 20 ? 68 >= 68 : 22 * 2 >> a++) / --b);
        // Выражение не компилируется так как в тернарном орераторе второй операнд (68 >= 68)
        // получается булевого типа и он не может быть затем поделен на --b = 7.

        // 6 - 2 > 3 && 12 * 12 <= 119
        System.out.println(6 - 2 > 3 && 12 * 12 <= 119);
        // Ответ false (6 - 2 = 4, 12 * 12 = 144, 4 > 3 = true, 144 <= 119 = false,
        // true && false = false).

        // true && false
        System.out.println(true && false);
        // Ответ false.
    }
}
